HELLO_MESSAGE = 'Привет! Давай начнем.'

MAIN_MENU = 'Ты в главном меню'
WHAT_TO_SEE = 'Что просмотреть?'
WHAT_PERIOD_TO_SEE = 'За какое время?'

ANALYTICS_HELLO_HABIT = 'Пользователи бота - {}\n' \
						'Новые пользователи - {}\n' \
						'Отток - {}\n' \
						'Дней пользования ботом (ср.) - {}\n'\
						'Пользователи без привычек - {}\n'\
						'Активные привычки - {}\n'\
						'Выполнения - {}\n'\
						'Пропуски - {}\n'\
						'Оплаты - {}\n'\
						'Выручка - {}\n'\
						'Пары бади - {}\n'\
						'Инвайты - {}\n'\
						'Одобрения - {}\n'\
						'Пинки - {}\n'\
						'Репосты - {}\n'
						
ANALYTICS_ORGANISATOR = "Марафоны - {}\n" \
						"Бесплатные - {}\n" \
						"Платные - {}\n" \
						"Участники - {}\n" \
						"Организаторы - {}\n" \
						"Задания - {}\n" \
						"Привычки - {}\n" \
						"Уроки - {}\n" \
						"Оценка уроков - {}\n" \
						"Оплаты - {}\n" \
						"Выручка - {}\n" \
						"Прибыль - {}\n" \

DATE_START = 'Выберите дату начала периода'
DATE_END = 'Выберите дату окончания периода'

DATE_START_SECOND = 'Выберите дату начала второго периода'
DATE_END_SECOND = 'Выберите дату окончания второго периода'

SELECTED_DATE = 'Вы выбрали дату {}'
PERIOD_IS_SELECTED = 'Период выбран'

NO_NEW_REVIEWS = 'У тебя нет новых отзывов'
WRITE_MSG = 'Введи сообщение. Будет отправлено всем пользователям'
MSG_FOR_ALL = 'Отправить это сообщение всем пользователям?\n"{}"'

MSG_LOG = 'Лог:\n{}'
CONTACTS = 'Контакты:\n{}'
MARATHON = 'Марафон:\n{}'

INCORRECT_INPUT = "Вы ввели некорректные данные!"

REJECT_IS_SENDED = "Отклонение отправлено"
NEED_COMMENT_FOR_REJECT = 'Введи комментарий к отклонению'